tutorials/Test2/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.10                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(


    (-0.05 -1 -2)//0
    (0.05 -1 -2)//1
    (0.05 3 -2)//2
    (-0.05 3 -2)//3
    (-0.05 -1 2)//4
    (0.05 -1 2)//5
    (0.05 3 2)//6
    (-0.05 3 2)//7



);
blocks
(
    hex (0 1 2 3 4 5 6 7) (1 60 60) simpleGrading (1 1 1)		//REGION 1



);

edges
(
);

boundary
(

    lowerWall
    {
        type wall;
        faces
        (
            (3 7 6 2)

        );
    }

    atmosphere
    {
        type patch;
        faces
        (
            (1 5 4 0)
        );
    }
    rightWall
    {
        type empty;
        faces
        (
            (1 2 6 5)
	    
        );
    }
    leftWall
    {
        type empty;
        faces
        (
            (0 4 7 3)
        );
    }
    frontAndBack
    {
        type patch;
        faces
        (
            (0 3 2 1)
	    (5 6 7 4)
        );
    }
);

mergePatchPairs
(


);

// ************************************************************************* //
