tutorials/Test2/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    lowerWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          60;
        startFace       7080;
    }
    atmosphere
    {
        type            patch;
        nFaces          60;
        startFace       7140;
    }
    rightWall
    {
        type            empty;
        inGroups        1(empty);
        nFaces          3600;
        startFace       7200;
    }
    leftWall
    {
        type            empty;
        inGroups        1(empty);
        nFaces          3600;
        startFace       10800;
    }
    frontAndBack
    {
        type            patch;
        nFaces          120;
        startFace       14400;
    }
)

// ************************************************************************* //
